package com.LogicaleGame;

public class SendMessege {
    static void StartGemeMessege(){
        System.out.println("В данной игре вам нужно переправить четырех человек через реку. \n" +
                "Каждый человек плывет с разной скоростью.\n" +
                "Вам дается восемнадцать часов.\n" +
                "Вай плывет 1 час\n" +
                "Ах плывет  2 часа" +
                "\nБах плывет 5 часов" +
                "\nЮг плывет 10 часов" +
                "\nВ лодку помещается два человека и время отнимается от наибольшего." +
                "\nЛодка сама по себе плыть не может по этому кому то ее придется вернуть обратно.");
    }
}
