package com.company;

public class Main {

    public static void main(String[] args) {
        System.out.println("Hello Git!!!");
        // контроль версии нужен для совмещения работы над одним проэктом и контроля его изменений
        // для упрощения данной операци в которой встречаются и разница во временни а так же в растоянии допустим в другой стране
        // что бы видеть когда и какие изменения были внесенны в проэкт групой человек или их разными индевидами
        // используется гидхаб
        // так же гит позволяет вернуть первоночальный код до изменения каким либо программистом если вдруг что то пошло не так
        // команда в гит хабе Commit как я понимаю это коминтарий формы и вида изменения с указание в каком файле и для ччего это
        // было сделано
        // команда push эот заливка измененного проэкта в основной корневой коталог или в ветку которая находится на сервере
        // по сути гид как я понял это что то наподобии основной виртуальной папки с возможностью отката изменений
        // при этом откат можно проводить выбарочно
    }
}
