package org.example;



import org.example.taskA.TaskA;
import org.example.taskD.TaskD;

public class Main {
    public static void main(String[] args) {

        // задание первое
        TaskA.startTaskA();
        //------------------------------------------------------------------------------------------------------------------
        // задание второе находится в пакете Таск Б в TXT файле
        //------------------------------------------------------------------------------------------------------------------
        // задание третье идет при запуске сервера (ТомКэт)
        //------------------------------------------------------------------------------------------------------------------
        //  задание третье
        TaskD.startTaskD();
        //------------------------------------------------------------------------------------------------------------------

    }




}
